rhapsodyv/OpenBLT-STM32/src/stm32/flash.c
  /* search through the sectors to find the right one */
  for (sectorIdx = 0; sectorIdx < FLASH_TOTAL_SECTORS; sectorIdx++)
  {
    /* keep the watchdog happy */
    CopService();
    if (flashLayout[sectorIdx].sector_num == sector)
    {
      return flashLayout[sectorIdx].sector_size;
    }
  }
  /* still here so no valid sector found */
  return 0;
} /*** end of FlashGetSectorSize ***/
#endif

/************************************************************************************//**
** \brief     Erases the flash sectors from first_sector up until last_sector.
** \param     first_sector First flash sector number.
** \param     last_sector  Last flash sector number.
** \return    BLT_TRUE if successful, BLT_FALSE otherwise.
**
****************************************************************************************/
static blt_bool FlashEraseSectors(blt_int8u first_sector, blt_int8u last_sector)
{
  blt_bool result = BLT_TRUE;
  FLASH_EraseInitTypeDef eraseInitStruct;
  blt_int32u eraseSectorError = 0;

  /* validate the sector numbers */
  if (first_sector > last_sector)
  {
    result = BLT_FALSE;
  }
  if ((first_sector < flashLayout[0].sector_num) || \
      (last_sector > flashLayout[FLASH_TOTAL_SECTORS-1].sector_num))
  {
    result = BLT_FALSE;
  }

  /* only move forward with the erase operation if all is okay so far */
  if (result == BLT_TRUE)
  {
    /* intialize the sector erase info structure */
    #if defined(STM32F1)
      blt_int16u nr_of_blocks;
      blt_addr   start_addr;
      blt_addr   end_addr;
      blt_int16u block_cnt;
      #if (BOOT_NVM_SIZE_KB > 64)
        /** \brief Number of bytes to erase per erase operation. */
        #define FLASH_ERASE_BLOCK_SIZE          (0x800)
      #else
        /** \brief Number of bytes to erase per erase operation. */
        #define FLASH_ERASE_BLOCK_SIZE          (0x400)
      #endif
      /* determine how many blocks need to be erased */
      start_addr = FlashGetSectorBaseAddr(first_sector);
      end_addr = FlashGetSectorBaseAddr(last_sector) + FlashGetSectorSize(last_sector) - 1;
      nr_of_blocks = (end_addr - start_addr + 1) / FLASH_ERASE_BLOCK_SIZE;
      eraseInitStruct.TypeErase = FLASH_TYPEERASE_PAGES;
      eraseInitStruct.PageAddress = start_addr;
      eraseInitStruct.NbPages     = 1;
    #else
      blt_int8u sectorIdx;
      eraseInitStruct.TypeErase = FLASH_TYPEERASE_SECTORS;
      eraseInitStruct.VoltageRange = FLASH_VOLTAGE_RANGE_3;
      eraseInitStruct.NbSectors = 1;
    #endif

    /* unlock the flash array */
    HAL_FLASH_Unlock();

    #if defined(STM32F1)
    /* erase all blocks one by one */
    for (block_cnt=0; block_cnt<nr_of_blocks; block_cnt++)
    #else
    /* erase all sectors one by one */
    for (sectorIdx=first_sector; sectorIdx<= last_sector; sectorIdx++)
    #endif
    {
      /* keep the watchdog happy */
      CopService();
      #if !defined(STM32F1)
        /* set the sector to erase */
        eraseInitStruct.Sector = sectorIdx;
      #endif
      /* submit the sector erase request */
      if(HAL_FLASHEx_Erase(&eraseInitStruct, (uint32_t *)&eraseSectorError) != HAL_OK)
      {
        /* could not perform erase operation */
        result = BLT_FALSE;
        /* error detected so don't bother continuing with the loop */
        break;
      }

      #if defined(STM32F1)
        /* update the page base address for the next sector. */
        eraseInitStruct.PageAddress += FLASH_ERASE_BLOCK_SIZE;
      #endif
    }

    /* lock the flash array again */
    HAL_FLASH_Lock();
  }

  /* give the result back to the caller */
  return result;
} /*** end of FlashEraseSectors ***/


/************************************************************************************//**
** \brief     Determines the flash sector the address is in.
** \param     address Address in the flash sector.
** \return    Flash sector number or FLASH_INVALID_SECTOR.
**
****************************************************************************************/
static blt_int8u FlashGetSector(blt_addr address)
{
  blt_int8u result = FLASH_INVALID_SECTOR;
  blt_int8u sectorIdx;

  /* search through the sectors to find the right one */
  for (sectorIdx = 0; sectorIdx < FLASH_TOTAL_SECTORS; sectorIdx++)
  {
    /* keep the watchdog happy */
    CopService();
    /* is the address in this sector? */
    if ((address >= flashLayout[sectorIdx].sector_start) && \
        (address < (flashLayout[sectorIdx].sector_start + \
                    flashLayout[sectorIdx].sector_size)))
    {
      /* found the sector we are looking for so store it */
      result = flashLayout[sectorIdx].sector_num;
      /* all done so no need to continue looping */
      break;
    }
  }
  /* give the result back to the caller */
  return result;
} /*** end of FlashGetSector ***/


/*********************************** end of flash.c ************************************/
